/************************************************************************************************/
/** 
 * @file		KsIAnimationController.h
 * @brief		アニメーションコントローラーインターフェースクラス
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSIANIMATIONCONTROLLER_H__
#define __KSIANIMATIONCONTROLLER_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsIAnimationController
 * @brief		アニメーションコントローラーインターフェースクラス
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class ksENGINE_API KsIAnimationController
{
	public:
		/**
		 * コンストラクタ
		 */
		KsIAnimationController();

		/**
		 * デストラクタ
		 */
		virtual							~KsIAnimationController();

		/**
		 * ローカルトランスフォームマトリックスを取得する
		 * @return		ローカルトランスフォームマトリックス
		 */
		virtual KsMatrix4x4				getCurrentBoneTransform( const KsBone* pPose ) = 0;
		virtual KsBool					containsAnimationTrack( const KsBone* pPose ) = 0;
		//virtual event EventHandler AnimationTracksChanged;
};

#endif		/* __KSIANIMATIONCONTROLLER_H__ */



