/************************************************************************************************/
/** 
 * @file		KsIAttachable.h
 * @brief		アタッチインターフェースクラス
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSIATTACHABLE_H__
#define __KSIATTACHABLE_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsIAttachable
 * @brief		アタッチインターフェースクラス
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class ksENGINE_API KsIAttachable
{
	public:
		/**
		 * コンストラクタ
		 */
		KsIAttachable();

		/**
		 * デストラクタ
		 */
		virtual							~KsIAttachable();

		/**
		 * ローカルトランスフォームマトリックスを取得する
		 * @return		ローカルトランスフォームマトリックス
		 */
		virtual KsMatrix4x4*			getLocalTransform() = 0;

		/**
		 * コンバイントランスフォームマトリックスを取得する
		 * @return		コンバイントランスフォームマトリックス
		 */
		virtual KsMatrix4x4*			getCombinedTransform() = 0;

		/**
		 * コンバイントランスフォームマトリックスをセットする
		 * @param		pMatrix			コンバイントランスフォームマトリックス
		 */
		virtual void					setCombinedTransform( const KsMatrix4x4* pMatrix ) = 0;

		/**
		 * ボーンポーズを取得する
		 * @return		ボーンポーズ
		 */
		virtual KsBonePose*				getAttachedBone() = 0;
};


#endif		/* __KSIATTACHABLE_H__ */



