/************************************************************************************************/
/** 
 * @file		KsGameConfigManager.h
 * @brief		ゲームコンフィッグ
 * @author		Tsukasa Kato
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.1
 */
/************************************************************************************************/
#ifndef __KSGAMECONFIGMANAGER_H__
#define __KSGAMECONFIGMANAGER_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * @class		KsGameConfigManager
 * @brief		ゲームコンフィッグ
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class KsGameConfigManager : public KsSingleton< KsGameConfigManager >
{
	public:
		/**
		 * シングルトンの参照を取得
		 * @return							シングルトンの参照
		 */
		static KsGameConfigManager&			getInstance();
		
		/**
		 * シングルトンのポインタを取得
		 * @return							シングルトンのポインタ
		 */
		static KsGameConfigManager*			getInstancePtr();

		/**
		 * セットアップ処理する
		 */
		static void							setup();

		/**
		 * 後処理処理する
		 */
		static void							shutdown();

	public:
		/**
		 * コンストラクタ
		 */
											KsGameConfigManager();

		/**
		 * デストラクタ
		 */
		virtual								~KsGameConfigManager();

		/** 
		 * ファイルパックからシェダーを生成する
		 * @param	rFileName		ファイルパック
		 * @retval	ksTRUE			成功
		 * @retval	ksFALSE			失敗
		 */
		KsBool								create( const KsString& rFileName );

		/**
		 * すべてのリソースを解放する
		 */
		void								destroy();

	protected:
		KsBool								m_isWindowMode;		/**< ウィンドウモードかどうか	*/
		KsInt32								m_windowWidth;
		KsInt32								m_windowHeight;
};

#endif /* __KSGAMECONFIGMANAGER_H__ */

