/************************************************************************************************/
/** 
 * @file		KsBoundingSphere.h
 * @brief		バウンディングスフィア
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsEngine/KsEnginePreCompile.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/*
 * コンストラクタ
 */
/************************************************************************************************/
KsBoundingSphere::KsBoundingSphere()
	: m_center( KsVector3d::ZERO )
	, m_radius( 0.0f )
{
}

/************************************************************************************************/
/*
 * コンストラクタ
 * @brief	KsBoundingSphere の新しいインスタンスを作成します。
 * @param	center		 球の中心点。
 * @param	radius		 球の半径。
 */
/************************************************************************************************/
KsBoundingSphere::KsBoundingSphere( const KsVector3d& center, KsReal radius )
	: m_center( center )
	, m_radius( radius )
{
}

/************************************************************************************************/
/*
 * コンストラクタ
 * @brief	KsBoundingSphere の新しいインスタンスを作成します。
 * @param	cx			 球の中心点のX座標。
 * @param	cy			 球の中心点のX座標。
 * @param	cz			 球の中心点のX座標。
 * @param	radius		 球の半径。
 */
/************************************************************************************************/
KsBoundingSphere::KsBoundingSphere( KsReal cx, KsReal cy, KsReal cz, KsReal radius )
	: m_center( cx, cy, cz )
	, m_radius( radius )
{
}

/************************************************************************************************/
/*
 * KsBoundingSphere をセットします。
 * @param	center		 球の中心点。
 * @param	radius		 球の半径。
 */
/************************************************************************************************/
void KsBoundingSphere::set( const KsVector3d& center, KsReal radius )
{
	m_center = center;
	m_radius = radius;
}

/************************************************************************************************/
/*
 * KsBoundingSphere をセットします。。
 * @param	cx			 球の中心点のX座標。
 * @param	cy			 球の中心点のX座標。
 * @param	cz			 球の中心点のX座標。
 * @param	radius		 球の半径。
 */
/************************************************************************************************/
void KsBoundingSphere::set( KsReal cx, KsReal cy, KsReal cz, KsReal radius )
{
	m_center.set( cx, cy, cz );
	m_radius = radius;
}


