/************************************************************************************************/
/** 
 * @file		KsShaderProgram.h
 * @brief		シェーダーオブジェクト
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSSHADERPROGRAM_H__
#define __KSSHADERPROGRAM_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/


/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * @class		KsShaderProgram
 * @brief		シェーダー
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @note		
 */
/************************************************************************************************/
class ksENGINE_API KsShaderProgram : public KsRefCounter
{
		friend class KsShaderManager;
	public:
		/**
		 * コンストラクタ
		 */
									KsShaderProgram();

		/**
		 * コンストラクタ
		 */
									KsShaderProgram( ksSHADER_TYPE type );

		/**
		 * デストラクタ
		 */
		virtual						~KsShaderProgram();

		/**
		 * データからシェーダーを生成する
		 * @param	pData			データ
		 * @param	dataSize		データサイズ
		 * @retval	ksTRUE			生成成功
		 * @retval	ksFALSE			生成失敗
		 */
		virtual KsBool				createFromMemory( const void* pData, KsUInt32 dataSize ) = 0;

		/**
		 * シェーダーIDを取得する
		 * @return					シェーダーID
		 */
		KsUInt32					getID() const { return m_id; }

		/**
		 * シェーダー名を取得する
		 * @return					シェーダー名
		 */
		const KsString&				getName() { return m_name; }

		/**
		 * シェーダータイプを取得する
		 * @return					シェーダータイプ
		 */
		ksSHADER_TYPE				getType() const { return m_type; }

	protected:
		KsUInt32					m_id;				/**< シェーダーID		*/
		KsString					m_name;				/**< シェーダー名		*/
		ksSHADER_TYPE				m_type;				/**< シェーダータイプ		*/
};


#endif		/* __KSSHADERPROGRAM_H__ */

