/************************************************************************************************/
/** 
 * @file		KsBoxShapeBullet.h
 * @brief		物理シミュレーションシステム
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSBOXSHAPEBULLET_H__
#define __KSBOXSHAPEBULLET_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsBoxShapeBullet
 * @brief		物理シミュレーションシステム
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
class ksPHYSICSBULLET_API KsBoxShapeBullet : public KsCollisionShape
{
	public:
		/**
		 * コンストラクタ
		 */
									KsBoxShapeBullet( const KsVector3d& halfExtents );

		/**
		 * コンストラクタ
		 */
									KsBoxShapeBullet( KsReal width, KsReal height, KsReal depth );

		/**
		 * デストラクタ
		 */
		virtual						~KsBoxShapeBullet();

		/**
		 * 慣性テンソルの計算
		 */
		virtual void				calculateLocalInertia( KsReal mass, KsVector3d& inertia );

		/**
		 * コリジョンシェイプのリソースを取得する
		 */
		virtual void*				getCollisionShapeResource() { return m_pBoxShape; }

	private:
		btBoxShape*					m_pBoxShape;
};

#endif		/* __KSBOXSHAPEBULLET_H__ */

