/************************************************************************************************/
/** 
 * @file		KsCapsuleShapeBullet.h
 * @brief		物理シミュレーションシステム
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSCAPSULESHAPEBULLET_H__
#define __KSCAPSULESHAPEBULLET_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsCapsuleShapeBullet
 * @brief		物理シミュレーションシステム
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
class ksPHYSICSBULLET_API KsCapsuleShapeBullet : public KsCollisionShape
{
	public:
		/**
		 * コンストラクタ
		 */
									KsCapsuleShapeBullet( KsReal radius, KsReal height );

		/**
		 * デストラクタ
		 */
		virtual						~KsCapsuleShapeBullet();

		/**
		 * 慣性テンソルの計算
		 */
		virtual void				calculateLocalInertia( KsReal mass, KsVector3d& inertia );

		/**
		 * コリジョンシェイプのリソースを取得する
		 */
		virtual void*				getCollisionShapeResource() { return m_pCapsuleShape; }

	private:
		btCapsuleShape*				m_pCapsuleShape;
};

#endif		/* __KSCAPSULESHAPEBULLET_H__ */

