/************************************************************************************************/
/** 
 * @file		KsSphereShapeBullet.h
 * @brief		物理シミュレーションシステム
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSSPHERESHAPEBULLET_H__
#define __KSSPHERESHAPEBULLET_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsSphereShapeBullet
 * @brief		物理シミュレーションシステム
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
class ksPHYSICSBULLET_API KsSphereShapeBullet : public KsCollisionShape
{
	public:
		/**
		 * コンストラクタ
		 */
									KsSphereShapeBullet( KsReal radius );

		/**
		 * デストラクタ
		 */
		virtual						~KsSphereShapeBullet();

		/**
		 * 慣性テンソルの計算
		 */
		virtual void				calculateLocalInertia( KsReal mass, KsVector3d& inertia );

		/**
		 * コリジョンシェイプのリソースを取得する
		 */
		virtual void*				getCollisionShapeResource() { return m_pSphereShape; }

	private:
		btSphereShape*				m_pSphereShape;
};

#endif		/* __KSSPHERESHAPEBULLET_H__ */

