/************************************************************************************************/
/** 
 * @file		KsPhysicsParameter.h
 * @brief		物理シミュレーションシステム
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSPHYSICSPARAMETER_H__
#define __KSPHYSICSPARAMETER_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/
class KsBone;

/************************************************************************************************/
/**
 * @class		KsPhysicsParameter
 * @brief		物理シミュレーションシステム
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
class ksENGINE_API KsPhysicsParameter
{
	public:
		KsPhysicsParameter();

		~KsPhysicsParameter();

		void			update( KsReal elapsedTime );
		void			fixPosition( KsReal elapsedTime );
		void			moveToBonePos();

	public:
		KsInt32			m_type;
		KsBool			m_noCopyToBone;
		KsBone*			m_pBone;
		KsRigidBody*	m_pRigidBody;
		KsMatrix4x4		m_boneOffset;
		KsMatrix4x4		m_invBoneOffset;
};

#endif		/* __KSPHYSICSPARAMETER_H__ */

