/************************************************************************************************/
/** 
 * @file		KsHumanIK.h
 * @brief		人間用IK
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#ifndef __KSHUMANIK_H__
#define __KSHUMANIK_H__

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


#if 0
/************************************************************************************************/
/**
 * @class		KsIKParameter
 * @brief		
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class ksENGINE_API KsIKParameter
{
	public:
		KsString				BoneName;			// IKボーン番号
		KsString				TargetBoneName;		// IKターゲットボーン番号( IKボーンが最初に接続するボーン )
		KsInt32					BoneIndex;			// IKボーン番号
		KsInt32					TargetBoneIndex;	// IKターゲットボーン番号( IKボーンが最初に接続するボーン )
		KsInt32					ChainLength;		// IKチェーンの長さ(子の数)
		KsInt32					Iterations;			// 再帰演算回数( IK値1 )
		KsReal					ControlWeight;		// IKの影響度( IK値2 )
		KsArray<KsInt32>		ChildBoneIndices;	// IK影響下のボーン番号(ChainLength)
		KsArray<KsString>		ChildBoneNames;		// IK影響下のボーン番号(ChainLength)
};

#endif

#endif		/* __KSHUMANIK_H__ */

