/************************************************************************************************/
/** 
 * @file		KsAdapter.h
 * @brief		アダプタクラスのインターフェイス
 * @author		Tsukasa Kato
 * @date		2010/10/17
 * @since		2004/10/17
 * @version		0.1
 */
/************************************************************************************************/
#ifndef __KSADAPTER_H__
#define __KSADAPTER_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/
class KsDisplayMode;
class KsDisplayModeList;

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsAdapter
 * @brief		アダプタクラス
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.10
 * @note		なし
 */
/************************************************************************************************/
class ksENGINE_API KsAdapter
{
	public:
		/**
		 * コンストラクタ
		 */
											KsAdapter(){}

		/**
		 * デストラクタ
		 */
		virtual								~KsAdapter(){}

		/**
		 * アダプタ名を取得する
		 * @return							アダプタ名
		 */
		virtual const KsString&				getAdapterName() = 0;

		/**
		 * アダプタ詳細を取得する
		 * @return							アダプタ詳細
		 */
		virtual const KsString&				getAdapterDescription() = 0;

		/**
		 * アダプタナンバーを取得する
		 * @return							アダプタナンバ		
		 */
		virtual const KsDisplayMode*		getDisplayMode( KsInt32 index ) = 0;

		/**
		 * アダプタナンバーを取得する
		 * @return							アダプタナンバ		
		 */
		virtual const KsDisplayModeList*	getDisplayModeList() = 0;

	protected:
		/**
		 * ディスプレイモードを列挙する
		 * @return	yTrue					列挙成功
		 */
		virtual KsBool						enumerateDisplayMode() = 0;
};

#endif /*__KSADAPTER_H__*/





