/************************************************************************************************/
/** 
 * @file		KsLight.h
 * @brief		ライト
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSLIGHT_H__
#define __KSLIGHT_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * ライトのタイプ
 */
/************************************************************************************************/
typedef enum _ksLIGHT_TYPE
{
	ksLIGHT_TYPE_DIRECTION = 1,				/**< 平行光源				*/
	ksLIGHT_TYPE_POINT     = 2,				/**< 位置光源				*/
	ksLIGHT_TYPE_SPOT      = 3,				/**< スポットライト			*/
	ksLIGHT_TYPE_FORCE32   = 0x7fffffff		/**< 強制的に32ビットにする	*/

}ksLIGHT_TYPE;

/************************************************************************************************/
/**
 * @class		StLight
 * @brief		ライトクラス
 * @author		kato tukasa
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class ksENGINE_API KsLight
{
	public:
		ksLIGHT_TYPE					m_type;				/**< ライトのタイプ				*/
		KsColorReal						m_diffuse;			/**< ディフューズ色( 拡散光 )		*/
		KsColorReal						m_specular;			/**< スペキュラ色( 鏡面光 )		*/
		KsColorReal						m_ambient;			/**< アンビエント色( 環境光 )		*/
		KsVector3d						m_position;			/**< 位置						*/
		KsVector3d						m_direction;		/**< 方向						*/
		KsReal							m_range;			/**< 光源の有効距離				*/
		KsReal							m_falloff;			/**< ライト収束係数				*/
		KsReal							m_attenuation0;		/**< 減衰係数0					*/
		KsReal							m_attenuation1;		/**< 減衰係数1					*/
		KsReal							m_attenuation2;		/**< 減衰係数2					*/
		KsReal							m_theta;			/**< ライトの有効範囲				*/
		KsReal							m_phi;				/**< ライトの有効範囲				*/

		/**
		 * コンストラクタ
		 */
										KsLight();

		/**
		 * ライト( = )演算子
		 * @param		light			値をコピーするベクトル
		 * @return						自分自身のベクトル参照( *this )
		 */
		const KsLight&					operator = ( const KsLight& light );
};


#endif		/* __KSLIGHT_H__ */

