/************************************************************************************************/
/** 
 * @file		KsLine3DBatch.h
 * @brief		描画
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSLINE3DBATCH_H__
#define __KSLINE3DBATCH_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsLine3DBatch
 * @brief		Line3D 描画
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class ksENGINE_API KsLine3DBatch
{
	public:
		/**
		 * コンストラクタ
		 * @param	count			最大プリミティブ数
		 */
									KsLine3DBatch();

		/**
		 * デストラクタ
		 */
		virtual						~KsLine3DBatch();

		/**
		 * バッファを生成する
		 * @param	count			最大プリミティブ数
		 */
		virtual void				create( KsUInt32 count ) = 0;

		/**
		 * バッファを破棄する
		 */
		virtual void				destroy() = 0;

		/**
		 * カラーをセットする
		 * @param	rectColor		カラー値
		 */
		virtual void				setColor( const KsColorReal& lineColor ) = 0;

		/**
		 * カラーをセットする
		 * @param	r				R値
		 * @param	g				G値
		 * @param	b				B値
		 * @param	a				A値
		 */
		virtual void				setColor( KsReal r, KsReal g, KsReal b, KsReal a ) = 0;

		/**
		 * ライン描画する
		 * @param		start		X座標
		 * @param		end			Y座標
		 */
		virtual void				draw( const KsVector3d& start, const KsVector3d& end ) = 0;

		/**
		 * バッファを一括描画する
		 * @param	pRenderContext	描画コンテキスト
		 */
		virtual void				flush( KsRenderContext* pRenderContext ) = 0;
};



#endif		/* __KSLINE3DBATCH_H__ */



