/************************************************************************************************/
/** 
 * @file		KsSwfDefineShape4.h
 * @brief		SWFコマンド
 * @author		Tsukasa Kato
 * @date		2005/10/17
 * @since		2005/10/17
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSSWFDEFINESHAPE4_H__
#define __KSSWFDEFINESHAPE4_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsSwfDefineShape4
 * @brief		SWFコマンド
 * @author		Tsukasa Kato
 * @date		2005/10/17
 * @since		2005/10/17
 * @version		1.0.0
 * @note		なし
 */
/************************************************************************************************/
class ksSWF_API KsSwfDefineShape4 : public KsSwfCommand
{
	private:
		KsUInt16			m_shapeId;					/**< キャラクタ ID						*/
		KsSwfRect			m_shapeBounds;				/**< シェイプの大きさ						*/
		KsSwfRect			m_edgeBounds;				/**< ストロークを含まないシェイプの大きさ	*/
		KsBool				m_usesFillWindingRule;
		KsBool				m_usesNonScalingStrokes;
		KsBool				m_usesScalingStrokes;

	public:
		/**
		 * コンストラクタ
		 */
							KsSwfDefineShape4( KsFileObject* pFile );

		/**
		 * デストラクタ
		 */
		virtual				~KsSwfDefineShape4();

		/**
		 * コマンド実行
		 */
		virtual void		execute();
};

#endif	/* __KSSWFDEFINESHAPE4_H__ */


