/************************************************************************************************/
/** 
 * @file		KsGameSingltonTask.h
 * @brief		ゲームシングルトンタスク
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSCONTROLTASK_H__
#define __KSCONTROLTASK_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/
#include "KsGameCore.h"
#include "KsGameTask.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsGameSingltonTask
 * @brief		ゲームシングルトンタスク
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class KsGameSingltonTask : public KsGameTask, public KsSingleton< KsGameSingltonTask >
{
	public:
		/**
		 * コンストラクタ
		 */
											KsGameSingltonTask(){}

		/**
		 * デストラクタ
		 */
		virtual							~KsGameSingltonTask(){}

		/**
		 * シングルトンの参照を取得
		 * @return							シングルトンの参照
		 */
		static KsGameSingltonTask&			getInstance();
		
		/**
		 * シングルトンのポインタを取得
		 * @return							シングルトンのポインタ
		 */
		static KsGameSingltonTask*			getInstancePtr();

	protected:
		/**
		 * 初期化処理(マネージャに登録されたときに登録)
		 * @param		pParam				パラメータ
		 */
		virtual void*						initialize( void* pParam );

		/**
		 * タスクの実行
		 * @param		pParam				パラメータ
		 */
		virtual void*						execute( void* pParam );

		/**
		 * 描画処理
		 * @param		pParam				パラメータ
		 */
		virtual void*						render( void* pParam );

		/**
		 * 後処理関数でメモリーから削除されるときに呼ばれる
		 * @param		pParam				パラメータ
		 */
		virtual void*						terminate( void* pParam );
};

#endif		/* __KSCONTROLTASK_H__ */



