/************************************************************************************************/
/** 
 * @file		KsSingleton.h
 * @brief		シングルトン
 * @author		Tsukasa Kato
 * @data		2005/06/27
 * @since		2005/06/27
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSSINGLETON_H__
#define __KSSINGLETON_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
	* @class	KsSingleton
	* @brief	シングルトンクラス
	* @author	Tsukasa Kato
	* @data	2005/06/27
	* @since   2005/06/27
	* @note	仕様するときは、必ず継承してくださ。
	*/
/************************************************************************************************/
template< typename T > class KsSingleton
{
	protected:
		static	T*					m_pInstance;		/**< インスタンス	*/
	
	public:
    	/**
			* コンストラクタ
			*/
									KsSingleton() { m_pInstance = static_cast< T* >( this ); }

    	/**
    		* デストラクタ
    		*/
		virtual						~KsSingleton() { m_pInstance = 0; }
		
		/**
			* シングルトンの参照を取得
			* @return					シングルトンの参照
			*/
		static T&					getInstance() { return ( *m_pInstance );  }
		
		/**
			* シングルトンのポインタを取得
			* @return					シングルトンのポインタ
			*/
		static T*					getInstancePtr() {  return ( m_pInstance );  }
};

/************************************************************************************************/
/**
	* @class	KsSingletonDeclare
	* @brief	シングルトンクラス
	* @author	Tsukasa Kato
	* @data	2005/06/27
	* @since   2005/06/27
	* @note	仕様するときは、必ず継承してくださ。
	*/
/************************************************************************************************/
template< typename T > class KsSingletonDeclare
{
	protected:
		static	T*					m_pInstance;		/**< インスタンス	*/
	
	protected:
    	/**
			* コンストラクタ
			*/
									KsSingletonDeclare(){}

    	/**
    		* デストラクタ
    		*/
		virtual						~KsSingletonDeclare(){}
		
	public:

		/**
			* インスタンスの生成
			* @return					生成されたインスタンス
			*/
		static T*					createInstance() { if( !m_pInstance ) m_pInstance = new T; return m_pInstance; }


		/**
			* インスタンスの破棄
			*/
		static void					destoryInstance() { ksDELETE( m_pInstance ); }

		/**
			* シングルトンの参照を取得
			* @return					シングルトンの参照
			*/
		static T&					getInstance() { return ( *m_pInstance );  }
		
		/**
			* シングルトンのポインタを取得
			* @return					シングルトンのポインタ
			*/
		static T*					getInstancePtr() {  return ( m_pInstance );  }
};


#endif		/* __KSSINGLETON_H__ */


