/*************************************************************************************************/
/** 
 * @file	KsDevDX11Compile.h
 * @brief	コンパイルなどの設定
 * @author	Tsukasa Kato
 * @date	2008/02/12
 * @since	2008/02/12
 */
/*************************************************************************************************/
#ifndef __KSDEVDX11COMPILE_H__
#define __KSDEVDX11COMPILE_H__

/*===============================================================================================*/
/*								<< インクルードファイル >>										 */
/*===============================================================================================*/

/*===============================================================================================*/
/*                                     << 定義 >>                                                */
/*===============================================================================================*/

//#define ksBUILD_STATIC	// プロジェクトで設定
//#define ksBUILD_DYNAMIC	// プロジェクトで設定
//#define ksENGINE_EXPORTS	// プロジェクトで設定

/* 出力形式 */
#ifdef ksBUILD_STATIC
	#define ksDEVDX11_API
	#define ksDEVDX11_EXTERN
#else
	#ifdef ksDEVDX11_EXPORTS
		#define ksDEVDX11_API			__declspec(dllexport)
		#define ksDEVDX11_EXTERN
	#else
		#define ksDEVDX11_API			__declspec( dllimport )
		#define ksDEVD3D11_EXTERN		extern
	#endif
#endif

#define ksDEVDX11_CDECL __cdecl

/*===============================================================================================*/
/*                                     << 宣言 >>                                                */
/*===============================================================================================*/


#endif	/* __KSDEVDX11COMPILE_H__ */


