/************************************************************************************************/
/** 
 * @file		KsBlendStateDX11.h
 * @brief		DirectX用深度ステンシルステート
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSDBLENDSTATEDX11_H__
#define __KSDBLENDSTATEDX11_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * @class		KsBlendStateDX11
 * @brief		深度ステンシルステート
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @note		参照カウンタつき
 */
/************************************************************************************************/
class ksDEVDX11_API KsBlendStateDX11 : public KsBlendState
{
		friend class KsRenderSystemDX11;
		friend class KsRenderContextDX11;
	public:
		/**
		 * コンストラクタ
		 */
											KsBlendStateDX11( KsRenderSystemDX11* pDevice, const KS_BLEND_DESC* pBlendStateDesc );

		/**
		 * デストラクタ
		 */
		virtual								~KsBlendStateDX11();

		/**
		 * テクスチャの破棄
		 */
		virtual void						destroy();

		/**
		 * リソースを取得する
		 * @return							リソース
		 */
		virtual void*						getRenderResource();

	protected:
		ID3D11BlendState*					m_pState;
};

#endif		/* __KSDBLENDSTATEDX11_H__ */

