/************************************************************************************************/
/** 
 * @file		KsCommandListDX11.h
 * @brief		コマンドリスト(DX11用)
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSCOMMANDLISTDX11_H__
#define __KSCOMMANDLISTDX11_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * @class		KsCommandListDX11
 * @brief		コマンドリスト(DX11用)
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class ksDEVDX11_API KsCommandListDX11 : public KsCommandList
{
		friend class KsRenderSystemDX11;

	public:
		/**
		 * コンストラクタ
		 */
									KsCommandListDX11();

		/**
		 * デストラクタ
		 */
		virtual						~KsCommandListDX11();

		/**
		 * コマンドリストを取得する
		 */
		virtual void*				getCommandList() { return m_pCommandList; }

		/**
		 * コマンドリストBufferを取得する
		 */
		virtual void**				getCommandListBuffer() { return (void**)&m_pCommandList; }

		/**
		 * クリアーする
		 */
		virtual void				clear();

	public:
		ID3D11CommandList*			m_pCommandList;								/**< デバイスコンテキスト			*/
};

#endif		/* __KSCOMMANDLISTDX11_H__ */



