/************************************************************************************************/
/** 
 * @file		KsDepthStencilStateDX11.h
 * @brief		DirectX用深度ステンシルステート
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSDEPTHSTENCILSTATEDX11_H__
#define __KSDEPTHSTENCILSTATEDX11_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * @class		KsDepthStencilStateDX11
 * @brief		深度ステンシルステート
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @note		参照カウンタつき
 */
/************************************************************************************************/
class ksDEVDX11_API KsDepthStencilStateDX11 : public KsDepthStencilState
{
		friend class KsRenderSystemDX11;
		friend class KsRenderContextDX11;
	public:
		/**
		 * コンストラクタ
		 */
											KsDepthStencilStateDX11( KsRenderSystemDX11* pDevice, const KS_DEPTH_STENCIL_DESC* pDepthStencilDesc );

		/**
		 * デストラクタ
		 */
		virtual								~KsDepthStencilStateDX11();

		/**
		 * テクスチャの破棄
		 */
		virtual void						destroy();

		/**
		 * リソースを取得する
		 * @return							リソース
		 */
		virtual void*						getRenderResource();

	protected:
		ID3D11DepthStencilState*			m_pState;
};

#endif		/* __KSDEPTHSTENCILSTATEDX11_H__ */

