/************************************************************************************************/
/** 
 * @file		KsRenderTargetDX11.h
 * @brief		描画ターゲット
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSRENDERTARGETDX11_H__
#define __KSRENDERTARGETDX11_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * @class		KsRenderTargetDX11
 * @brief		描画ターゲット(DX11)
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class ksDEVDX11_API KsRenderTargetDX11 : public KsRenderTarget
{
		friend class KsRenderSystemDX11;
		friend class KsRenderContextDX11;
	public:
		/**
		 * コンストラクタ
		 */
									KsRenderTargetDX11();

		/**
		 * コンストラクタ
		 */
									KsRenderTargetDX11( ID3D11RenderTargetView* pTargetView );

		/**
		 * デストラクタ
		 */
		virtual						~KsRenderTargetDX11();

		/**
		 * ロックする
		 * @return					データのポインタ
		 */
		virtual void*				lock();

		/**
		 * ロックを解除する
		 */
		virtual void				unlock();
		/**
		 * テクスチャの破棄
		 */
		virtual void				destroy();

		/**
		 * リソースを取得する
		 * @return					 リソース
		 */
		virtual void*				getRenderResource() { return m_pTargetView; }

	protected:
		ID3D11RenderTargetView*		m_pTargetView;
};



#endif		/* __KSRENDERTARGETDX11_H__ */



