/************************************************************************************************/
/** 
 * @file		KsSamplerStateDX11.h
 * @brief		DirectX用サンプラーステート
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSSAMPLERSTATEDX11_H__
#define __KSSAMPLERSTATEDX11_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * @class		KsSamplerStateDX11
 * @brief		サンプラーステート
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @note		参照カウンタつき
 */
/************************************************************************************************/
class ksDEVDX11_API KsSamplerStateDX11 : public KsSamplerState
{
		friend class KsRenderSystemDX11;
		friend class KsRenderContextDX11;
	public:
		/**
		 * コンストラクタ
		 */
											KsSamplerStateDX11( KsRenderSystemDX11* pDevice, const KS_SAMPLER_DESC* pSamplerDesc );

		/**
		 * デストラクタ
		 */
		virtual								~KsSamplerStateDX11();

		/**
		 * テクスチャの破棄
		 */
		virtual void						destroy();

		/**
		 * リソースを取得する
		 * @return							リソース
		 */
		virtual void*						getRenderResource();

	protected:
		ID3D11SamplerState*					m_pState;
};

#endif		/* __KSSAMPLERSTATEDX11_H__ */

