/************************************************************************************************/
/** 
 * @file		KsThreadGroup.h
 * @brief		スレッド管理
 * @author		Tsukasa Kato
 * @date		2004/08/17
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSTHREADGROUP_H__
#define __KSTHREADGROUP_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsEngine/KsEnginePreCompile.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * スレッドグループ
 * @class	KsThreadGroup
 * @author  Tsukasa Kato
 * @since   2003/03/22
 * @version ----/--/--
 */
/************************************************************************************************/
class ksENGINE_API KsThreadGroup
{
	public:
		/**
		 * コンストラクタ
		 */
								KsThreadGroup();

		/**
		 * デストラクタ
		 */
								~KsThreadGroup();

		/**
		 * 指定スレッドこのグループに追加する
		 * @param	pThread		スレッドのポインタ
		 */
		void					addThread( KsThreadFunc func, void* pParam );

		/**
		 * 指定スレッドこのグループに追加する
		 * @param	pThread		スレッドのポインタ
		 */
		void					addThread( KsThread* pThread );

		/**
		 * 指定スレッドをこのグループから取り除く
		 * @param	pThread		スレッドのポインタ
		 */
		void					removeThread( KsThread* pThread );

		/**
		 * すべてのスレッドの終了を待機する
		 */
		void					joinAll();

		/**
		 * 登録されているスレッドの数を取得する
		 * @return				登録されているスレッドの数
		 */
		KsInt32					getNumThread();

	private:
		KsList<KsThread*>		m_threadList;	/**< スレッドリスト	*/
		KsMutex					m_mutex;		/**< 排他制御用		*/
};

#endif		/* __KSTHREADGROUP_H__ */

