/************************************************************************************************/
/** 
 * @file		KsInputSystem.cpp
 * @brief		入力処理
 * @author		Tsukasa Kato
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.1
 */
/************************************************************************************************/

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsEngine/KsEnginePreCompile.h"

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/


/* パッド１用キーアサイン */
static KSKEYASSIGN	pad1[] = 
{
	{ ksKEY_UP,    ksPAD_UP    },
	{ ksKEY_DOWN,  ksPAD_DOWN  },
	{ ksKEY_LEFT,  ksPAD_LEFT  },
	{ ksKEY_RIGHT, ksPAD_RIGHT },
	{ ksKEY_Z,     ksPAD_TRIG1 },
	{ ksKEY_X,     ksPAD_TRIG2 },
	{ ksKEY_C,     ksPAD_TRIG3 },
	{ ksKEY_SPACE, ksPAD_TRIG9 },
	{ 0,           0           }
};

/* 衝突するのでpad1とかぶらないようにする */
static KSKEYASSIGN	pad2[] = 
{
	{ ksKEY_UP,    ksPAD_UP    },
	{ ksKEY_DOWN,  ksPAD_DOWN  },
	{ ksKEY_LEFT,  ksPAD_LEFT  },
	{ ksKEY_RIGHT, ksPAD_RIGHT },
	{ ksKEY_Z,     ksPAD_TRIG1 },
	{ ksKEY_X,     ksPAD_TRIG2 },
	{ ksKEY_C,     ksPAD_TRIG3 },
	{ ksKEY_SPACE, ksPAD_TRIG9 },
	{ 0,           0           }
};

/* キーボードとパッドのアサインとりあえず2つまで */
static KSKEYASSIGN* s_pKeyInfo[] = 
{
	pad1,	/*< PAD1が参照する */
	pad2,	/*< PAD2が参照する */
	NULL,
};

/************************************************************************************************/
/*
 * @class		KsInputSystem
 * @brief		入力マネージャ(シングルトンクラス)
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.10
 * @note		なし
 */
/************************************************************************************************/
template<> KsInputSystem*	KsSingleton<KsInputSystem>::m_pInstance = 0;

/************************************************************************************************/
/*
 * インスタンス取得
 * @return				インスタンス
 */
/************************************************************************************************/
KsInputSystem&	KsInputSystem::getInstance()
{
	/*KsAssert( m_pInstance );*/
	return (*m_pInstance);
}

/************************************************************************************************/
/*
 * インスタンス取得
 * @return				インスタンス
 */
/************************************************************************************************/
KsInputSystem*	KsInputSystem::getInstancePtr()
{
	return m_pInstance;
}

/************************************************************************************************/
/*
 * コンストラクタ(初期化処理)
 * @param	num			ジョイスティックドライバがサポートするジョイスティック数
 */
/************************************************************************************************/
KsInputSystem::KsInputSystem() : m_bInit( ksFALSE )
{
}

/************************************************************************************************/
/*
 * コンストラクタ(初期化処理)
 * @param	num			ジョイスティックドライバがサポートするジョイスティック数
 */
/************************************************************************************************/
KsInputSystem::KsInputSystem( KsUInt32 num ) : m_bInit( ksFALSE )
{
	initialize( num );
}

/************************************************************************************************/
/*
 * デストラクタ
 */
/************************************************************************************************/
KsInputSystem::~KsInputSystem()
{
	release();
}

/************************************************************************************************/
/*
 * 初期化処理
 * @param	num				ジョイスティックドライバがサポートするジョイスティック数
 */
/************************************************************************************************/
void KsInputSystem::initialize( KsUInt32 num )
{
	if( !m_bInit )
	{
		JOYCAPS			joyCaps;

		m_padMax = ::joyGetNumDevs();
		m_padNum = 0;

		for( KsUInt32 i=0; i<m_padMax; i++ )
		{
			/* ジョイスティックを照会してその性能を調べます。 */
			if( joyGetDevCaps( JOYSTICKID1+i, &joyCaps, sizeof(JOYCAPS) ) == JOYERR_NOERROR )
			{
				++m_padNum;
				//m_vpPads.push_back( new KsPad( JOYSTICKID1+i ) );
			}
		}

		if( m_padNum == 0 )
		{
			m_padNum = 1;
		}

		for( KsUInt32 i=0; i< (num - m_padNum); i++ )
		{
			m_vpPads.push_back( new KsPad( JOYSTICKID1+i ) );
		}

		for( KsUInt32 i=0; i<1; i++ )
		{
			m_vpMouses.push_back( new KsMouse() );
		}

		m_bInit = ksTRUE;
	}
}

/************************************************************************************************/
/*
 * 更新処理
 */
/************************************************************************************************/
void KsInputSystem::update()
{
	KsUInt32	index = 0;
	KsUInt32	data  = 0;

	::GetKeyboardState( m_keyData );

	for( KsUInt32 i=0; i<m_padNum; i++ )
	{
		data  = m_vpPads[ i ]->read();
		data |= m_vpPads[ i ]->merge( s_pKeyInfo[ index ], m_keyData );
		m_vpPads[ i ]->update( data );
		index++;
	}

	for( KsUInt32 i=0; i<m_vpMouses.size(); i++ )
	{
		m_vpMouses[ i ]->update();
	}
}

/************************************************************************************************/
/*
 * 開放処理
 */
/************************************************************************************************/
void KsInputSystem::release()
{
	ksDELETEARRAYTEMPLATE( m_vpPads );
	ksDELETEARRAYTEMPLATE( m_vpMouses );
}



