/************************************************************************************************/
/** 
 * @file		KsScriptPreCompile.h
 * @brief		プリコンパイルヘッダー
 * @author		Tsukasa Kato
 * @date		2005/06/27
 * @since		2005/06/27
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSSWFCOMPILE_H__
#define __KSSWFCOMPILE_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

//#define ksBUILD_STATIC	// プロジェクトで設定
//#define ksBUILD_DYNAMIC	// プロジェクトで設定
//#define ksENGINE_EXPORTS	// プロジェクトで設定

/* 出力形式 */
#ifdef ksBUILD_STATIC
	#define ksSWF_API
	#define ksSWF_EXTERN
#else
	#ifdef ksSWF_EXPORTS
		#define ksSWF_API			__declspec(dllexport)
		#define ksSWF_EXTERN
	#else
		#define ksSWF_API			__declspec(dllimport)
		#define ksSWF_EXTERN		extern
	#endif
#endif

#define ksSWF_CDECL __cdecl


#endif	/* __KSSWFCOMPILE_H__ */
