/************************************************************************************************/
/** 
 * @file		KsSwfRecordHeader.h
 * @brief		レコードヘッダ
 * @author		Tsukasa Kato
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSSWFRECORDHEADER_H__
#define __KSSWFRECORDHEADER_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsSwfRecordHeader
 * @brief		SWF レコードヘッダ
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.10
 * @note		TagHeader 16bit
 *				| ID( 10 bit ) | length( 6 bit ) |
 *  tagID  = Code >> 6; 
 *  length = Code & 0x3f;
 *	length が 0x3f のときは32bit length
 */
/************************************************************************************************/
class ksSWF_API KsSwfRecordHeader
{
	    friend class KsSwfImporter;
	
	public:
		/**
		 * コンストラクタ
		 */
	    						KsSwfRecordHeader();

		/**
		 * コンストラクタ
		 * @param	id			タグID
		 * @param	size		タグのサイズ
		 */
	    						KsSwfRecordHeader( KsUInt16 id, KsUInt32 size );

		/**
		 * デストラクタ
		 */
	    virtual					~KsSwfRecordHeader();

		/**
		 * タグIDを取得する
		 * @return				タグID
		 */
	    KsUInt16				getID() const { return m_id; }
	
		/**
		 * タグのサイズを取得する
		 * @return				タグのサイズ
		 */
	    KsUInt32				getSize() const { return m_size; }

	private:
	    KsUInt16				m_id;		/**< タグID			*/
	    KsUInt32				m_size;		/**< タグのサイズ	*/
};

#endif /* __KSSWFRECORDHEADER_H__ */

