/************************************************************************************************/
/** 
 * @file		KsSwfShape.h
 * @brief		
 * @author		Tsukasa Kato
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSSWFSHAPE_H__
#define __KSSWFSHAPE_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsSwfShape
 * @brief		Flash(SWF)Header
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.10
 * @note		なし
 */
/************************************************************************************************/
class KsSwfShape
{
		friend class KsSwfImporter;

	private:
		KsUInt8				m_numFillBits;		// 塗りインデックスの数
		KsUInt8				m_numLineBits;		// 線インデックスの数
		//KsUInt8				m_vShapeRecords;	// シェイプレコード

	public: 
							KsSwfShape();

		KsUInt8				getNumFillBits() const { return m_numFillBits; }
		KsUInt8				getNumLineBits() const { return m_numLineBits; }

		void				setNumFillBits( KsUInt8 numFillBits ) { m_numFillBits = numFillBits; }
		void				setNumLineBits(  KsUInt8 numLineBits ) { m_numLineBits = numLineBits; }

};

#endif	/* __KSSWFSHAPE_H__ */

