/************************************************************************************************/
/** 
 * @file		KsGameMouse.h
 * @brief		ゲームマウス入力処理
 * @author		Tsukasa Kato
 * @date		2006/10/17
 * @since		2006/10/17
 * @version		0.1
 */
/************************************************************************************************/
#ifndef __KSGAMEMOUSE_H__
#define __KSGAMEMOUSE_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * @class		KsGameMouse
 * @brief		ゲームマウス入力処理
 * @date		2006/10/17
 * @since		2006/10/17
 * @version		0.10
 * @note		なし
 */
/************************************************************************************************/
class KsGameMouse
{
		friend class KsGamePadManager;
	public:
		/**
		 * デストラクタ
		 */
							~KsGameMouse();

	protected:
		/**
		 * コンストラクタ
		 */
							KsGameMouse( KsInputSystem* pInputSystem, KsInt32 mouseIndex );

	public:
		/**
		 * 更新処理
		 */
		virtual void		update();

		KsBool				isLeftButtonDown() const;
		KsBool				isLeftButtonUp() const;
		KsBool				isRightButtonDown() const;
		KsBool				isRightButtonUp() const;
		KsBool				isWheel() const;

		/**
		 * マウスのX座標を取得する
		 * @return			マウスのX座標
		 */
		KsInt32				getPosX()      const;

		/**
		 * マウスのY座標を取得する
		 * @return			マウスのY座標
		 */
		KsInt32				getPosY()      const;

		/**
		 * マウスのZ座標を取得する(ホイール)
		 * @return			マウスのZ座標
		 */
		KsInt32				getPosZ()      const;

	private:
		KsInputSystem*		m_pInputSystem;
		KsInt32				m_mouseIndex;
};

#endif /* __KSGAMEMOUSE_H__ */

