/************************************************************************************************/
/** 
 * @file		KsSceneManager.cpp
 * @brief		シーン管理
 * @author		Tsukasa Kato
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.1
 */
/************************************************************************************************/

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsGamePreCompile.h"
#include "KsSceneManager.h"
#include "KsTestScene.h"

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/*
 * コンストラクタ
 */
/************************************************************************************************/
KsSceneManager::KsSceneManager()
	: KsTaskManager( KsUpdateOrder::orderMax(), KsDrawOrder::orderMax() )
{
}

/************************************************************************************************/
/*
 * デストラクタ
 */
/************************************************************************************************/
KsSceneManager::~KsSceneManager()
{
}


/************************************************************************************************/
/*
 * 初期化処理
 * @retval		ksTRUE			成功
 * @retval		ksFALSE			失敗
 */
/************************************************************************************************/
KsBool KsSceneManager::initialize()
{
	createScene( ksSCENE_TEST_RENDER );

	/* 本当は、シーンごとにカメラをつけるべき */
	//addChild( new StCamera() );

	return ksTRUE;
}

/************************************************************************************************/
/*
 * 後処理
 * @retval		ksTRUE		成功
 * @retval		ksFALSE		失敗
 */
/************************************************************************************************/
KsBool KsSceneManager::terminate()
{
	return ksTRUE;
}

/************************************************************************************************/
/*
 * タスクの実行
 * @param		pParam				パラメータ
 */
/************************************************************************************************/
void KsSceneManager::execute( void* pParam )
{
#if 0
	/* シーンの変更をチェックする */
	switch( m_scene )
	{

		case ksSCENE_LOGO:
		{
			/* ロゴ */	
			addScene( ksSCENE_TITLE );
			break;
		}
		case ksSCENE_TITLE:
		{
			/* タイトル */
			if( stMOVIE_MODE_GGENE == pGM->getMovieMode() ){
				addScene( ksSCENE_GGENE_MENU );
			}
			else{
				addScene( ksSCENE_GUNDAM_MENU );
			}
			break;
		}
		case ksSCENE_GUNDAM_MENU:
		{
			addScene( ksSCENE_TITLE );
			break;
		}
		case ksSCENE_GGENE_MENU:
		{
			addScene( ksSCENE_TITLE );
			break;
		}
		default: { break; }
	}
#endif
}
/************************************************************************************************/
/*
 * 描画処理
 * @param		pParam				パラメータ
 */
/************************************************************************************************/
void KsSceneManager::render( void* pParam )
{
}

/************************************************************************************************/
/*
 * 後処理関数でメモリーから削除されるときに呼ばれる
 * @param		pParam				パラメータ
 * デバックメニューから好きなシーンを作れるようにする
 */
/************************************************************************************************/
KsScene* KsSceneManager::createScene( ksSCENE_TYPE scene )
{
	// シーン終了の時に次のシーンを指定して消える
	switch( scene )
	{
		case ksSCENE_LOGO:
		{
			/* ロゴ */
			//return new StLogo();
			////return new StMsgScriptTest();
		}
		case ksSCENE_TITLE:
		{
			/* タイトル */
		}
		case ksSCENE_TITLE_SELECT:
		{
			/* タイトル選択画面 */
			//return new StGundamMenu();
		}
		case ksSCENE_OPTION:
		{
			/* オプション */
		}
		case ksSCENE_TEST_RENDER:
		{
			return ksNew KsTestScene();
		}
		default: { break; }
	}

	return NULL;;
}

