/************************************************************************************************/
/** 
 * @file		KsFunction.h
 * @brief		スクリプト関数オブジェクト
 * @author		Tsukasa Kato
 * @date		2006/10/17
 * @since		2006/10/17
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSFUNCTION_H__
#define __KSFUNCTION_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/
#include "KsStringObject.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * スクリプト関数オブジェクト
 * @class	KsFunction
 * @author	Tsukasa Kato
 * @since   2006/--/--
 * @version 2006/--/--
 */
/************************************************************************************************/
class KsFunction : public KsStringObject
{
	public:
		/**
		 * コンストラクタ
		 */
									KsFunction(){}

		/**
		 * デストラクタ
		 */
		virtual					~KsFunction(){}


		/**
		 * オブジェトのタイプ取得
		 */
		virtual ksVALUE_TYPE		getType() const { return ksVALUE_FUNCTION; }

	public:
		void*						m_pCode;			/**< 中間コード					*/
		KsInt32					m_codeOffset;		/**< コードオフセット			*/
		KsInt32					m_codeSize;			/**< 中間コードのサイズ			*/
		KsHandle					m_handle;			/**< 関数固有のハンドルID		*/
		KsInt32					m_numArg;			/**< 引数の数					*/
		KsInt32					m_numLocal;			/**< ローカル変数の数			*/
		KsVariable*					m_pVariables;		/**< ローカル変数リスト			*/
		KsVariable*					m_pMembers;			/**< メンバ変数リスト			*/
};

#endif /* __KSFUNCTION_H__ */

