/************************************************************************************************/
/** 
 * @file		KsScriptPreCompile.h
 * @brief		プリコンパイルヘッダー
 * @author		Tsukasa Kato
 * @date		2005/06/27
 * @since		2005/06/27
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSSCRIPTCOMPILE_H__
#define __KSSCRIPTCOMPILE_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

//#define ksBUILD_STATIC	// プロジェクトで設定
//#define ksBUILD_DYNAMIC	// プロジェクトで設定
//#define ksENGINE_EXPORTS	// プロジェクトで設定

/* 出力形式 */
#ifdef ksBUILD_STATIC
	#define ksSCRIPT_API
	#define ksSCRIPT_EXTERN
#else
	#ifdef ksSCRIPT_EXPORTS
		#define ksSCRIPT_API			__declspec(dllexport)
		#define ksSCRIPT_EXTERN
	#else
		#define ksSCRIPT_API			__declspec( dllimport )
		#define ksSCRIPT_EXTERN		extern
	#endif
#endif

#define ksSCRIPT_CDECL __cdecl


#endif	/* __KSSCRIPTCOMPILE_H__ */
