/************************************************************************************************/
/** 
 * @file		KsStructObject.cpp
 * @brief		構造体オブジェクト
 * @author		Tsukasa Kato
 * @date		2006/10/17
 * @since		2006/10/17
 * @version		1.0.0
 */
/************************************************************************************************/


/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/
#include "KsScript/KsScriptPreCompile.h"
#include "KsStructObject.h"

/************************************************************************************************/
/*
 * コンストラクタ
 */
/************************************************************************************************/
KsStructObject::KsStructObject()
	: m_numVar( 0 )
	, m_numFunc( 0 )
	, m_pVarList( 0 )
	, m_pFuncList( 0 )
{
}

/************************************************************************************************/
/*
 * コンストラクタ
 * @param	pString			文字列
 */
/************************************************************************************************/
KsStructObject::KsStructObject( const KsChar* pString )
	: KsStringObject( pString )
	, m_numVar( 0 )
	, m_numFunc( 0 )
	, m_pVarList( 0 )
	, m_pFuncList( 0 )
{
}

/************************************************************************************************/
/*
 * デストラクタ
 */
/************************************************************************************************/
KsStructObject::~KsStructObject()
{
}

/************************************************************************************************/
/*
 * 名前から構造体情報を取得する
 * @param	pName				名前
 * @return						構造体メンバー情報
 */
/************************************************************************************************/
KsStructMemberInfo* KsStructObject::findVar( const KsChar* pName )
{
	KsStructMemberInfo*		pTemp = m_pVarList;

	while( pTemp )
	{
		if( strcmp( pTemp->name, pName ) == 0 )
		{
			return pTemp;
		}

		pTemp = pTemp->next;
	}

	return NULL;
}

/************************************************************************************************/
/*
 * 名前から構造体メンバー情報のインデックスを取得する
 * @param	pName				名前
 * @return						構造体メンバー情報のインデックス
 */
/************************************************************************************************/
KsInt32 KsStructObject::findVarIndex( const KsChar* pName )
{
	KsStructMemberInfo*		pTemp = m_pVarList;
	KsInt32					count = 0;

	while( pTemp )
	{
		if( strcmp( pTemp->name, pName ) == 0 )
		{
			return count;
		}

		++count;
		pTemp = pTemp->next;
	}

	return -1;
}


