/************************************************************************************************/
/** 
 * @file		KsBufferManagerDX.cpp
 * @brief		バッファマネージャ
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsBufferManagerDX.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/*
 * 頂点バッファを生成する
 * @param		vertexSize		頂点サイズ
 * @param		numVertex		頂点数
 * @param		vertexFormat	頂点フォーマット
 * @param		flags			フラグ
 * @return						頂点バッファのポインタ
 */
/************************************************************************************************/
KsVertexBuffer* KsBufferManagerDX::createVertexBuffer( KsUInt32 vertexSize, KsUInt32 numVertex, KsUInt32 vertexFormat, KsUInt32 flags )
{
	return new KsVertexBufferDX( m_pDevice, vertexSize, numVertex, vertexFormat, flags );
}
/************************************************************************************************/
/*
 * インデックスバッファを生成する
 * @param		numIndex		インデックス数
 * @param		flags			フラグ
 * @return						インデックスバッファのポインタ
 */
/************************************************************************************************/
KsIndexBuffer* KsBufferManagerDX::createIndexBuffer( KsUInt32 numIndex, KsUInt32 flags )
{
	return new KsIndexBufferDX( m_pDevice, numIndex, flags );
}



