/************************************************************************************************/
/** 
 * @file		KsCameraObject.h
 * @brief		カメラタスクのインターフェイス
 * @author		Tsukasa Kato
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.1
 */
/************************************************************************************************/
#ifndef __KSCAMERAOBJECT_H__
#define __KSCAMERAOBJECT_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsTask.h"

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsCameraObject
 * @brief		基本タスクマネージャクラス
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.10
 * @note		なし
 */
/************************************************************************************************/
class KsCameraObject : public KsTask
{
	public:
		/**
		 * コンストラクタ
		 */
											KsCameraObject(){}

		/**
		 * デストラクタ
		 */
		virtual							~KsCameraObject(){}


		/**
		 * 描画開始
		 */
		virtual void						beginRender() = 0;

		/**
		 * 描画終了
		 */
		virtual void						endRender() = 0;
	
	protected:
		/**
		 * 初期化処理(マネージャに登録されたときに登録)
		 * @param		pParam				パラメータ
		 */
		virtual void*						initialize( void* pParam ){ return pParam; }

		/**
		 * タスクの実行
		 * @param		pParam				パラメータ
		 */
		virtual void*						execute( void* pParam ){ return pParam; }

		/**
		 * 描画処理
		 * @param		pParam				パラメータ
		 */
		virtual void*						render( void* pParam ){ return pParam; }

		/**
		 * 後処理関数でメモリーから削除されるときに呼ばれる
		 * @param		pParam				パラメータ
		 */
		virtual void*						terminate( void* pParam ){ return pParam; }
};

#endif /*__KSCAMERAOBJECT_H__*/



