/************************************************************************************************/
/** 
 * @file		KsDIB.h
 * @brief		DIB
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSDIB_H__
#define __KSDIB_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsImage.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class	
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class KsDIB : public KsImage
{
	public:
		/**
		 * コンストラクタ
		 */
										KsDIB();
		
		/**
		 * デストラクタ
		 */
		virtual						~KsDIB();

		/**
		 * コンストラクタ(指定フォーマットでイメージ生成)
		 * @param		foramt			ピクセルフォーマット
		 * @param		width			幅
		 * @param		height			高さ
		 */
										KsDIB( ksPIXEL_FORMAT format, KsInt32 width, KsInt32 height );
		
		/**
		 * 指定フォーマットでイメージ生成する
		 * @param		foramt			ピクセルフォーマット
		 * @param		width			幅
		 * @param		height			高さ
		 * @retval		ksTRUE			生成成功
		 * @retval		ksFALSE			生成失敗
		 */
		virtual KsBool					create( ksPIXEL_FORMAT format, KsInt32 width, KsInt32 height );

		/**
		 * 開放処理
		 */
		virtual void					destroy();
	
		/**
		 * クリア処理
		 */
		void							clear( COLORREF color = RGB( 0, 255, 0 ) );

	public:
		KsInt32						m_size;				/**< サイズ							*/
		KsInt32						m_pitch;			/**< 一列のバイト数					*/
		HDC								m_hDC;				/**< デバイスコンテキスト				*/
		HBITMAP							m_hBitmap;			/**< ビットマップハンドル				*/
		HBITMAP							m_hBitmapOld;		/**< 過去のビットマップハンドル		*/
		HBRUSH							m_clearBrush;		/**< 指定した色でクリアーする			*/
};

#endif		/* __KSDIB_H__ */

