/************************************************************************************************/
/** 
 * @file		KsImageTGA.h
 * @brief		TGA
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSIMAGETGA_H__
#define __KSIMAGETGA_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsType.h"
#include "KsImage.h"
#include "KsFileObject.h"
#include <pshpack1.h>		// 1バイトパック用に読み込む

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * TGAのヘッダ部
 * @struct		KS_TGA_HEADER
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
typedef struct _KS_TGA_HEADER
{
	KsUInt8				idLength;		/**< 0=イメージＩＤ無し						*/
	KsUInt8				colorMapType;	/**< 0=カラーマップ無し						*/
	KsUInt8				imageType;		/**< 2=無圧縮RGBタイプ 10=圧縮RGBタイプ		*/
	KsUInt16				palletStart;	/**< 色パレットの開始番号						*/
	KsUInt16				palletMax;		/**< 色パレットの個数							*/
	KsUInt8				palletBits;		/**< 色パレットのビット数 15,16,24,32			*/
	KsUInt16				originX;		/**< 画面 左上 X 0固定						*/
	KsUInt16				originY;		/**< 画面 左上 Y 0固定						*/
	KsUInt16				width;			/**< 幅										*/
	KsUInt16				height;			/**< 高さ									*/
	KsUInt8				pixelDepth;		/**< Pixel Size. 32=32bit					*/
	KsUInt8				descriptor;		/**< 8=TGA32 アトリビュート					*/

}KS_TGA_HEADER;

/************************************************************************************************/
/**
 * TGAファイルかをチェックする
 * @param		pFileName		ファイル名
 * @retval		ksTRUE			成功
 * @retval		ksFALSE			失敗
 */
/************************************************************************************************/
extern KsBool KsIsFileExtensionTGA( const KsChar* pFileName );

/************************************************************************************************/
/**
 * TGA読み込み
 * @param		pFile		ファイル
 * @return					イメージデータ
 *							失敗したときはNULLを返す
 */
/************************************************************************************************/
//extern KsImage* KsLoadImageTGA( KsFileObject* pFile );


#endif		/* __KSIMAGETGA_H__ */

