/************************************************************************************************/
/** 
 * @file		KsMesh.h
 * @brief		カラー
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSMODEL_H__
#define __KSMODEL_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsType.h"
#include "KsModelNode.h"
#include "KsFileObject.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * 
 * @class	
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class KsModel
{
	public:
		/**
		 * コンストラクタ
		 */
										KsModel();

		/**
		 * コピーコンストラクタ
		 */
										KsModel( const KsModel* pModel );

		/**
		 * デストラクタ
		 */
		virtual						~KsModel();

		/**
		 * 描画する
		 */
		void							Render();

		/**
		 * クローン
		 */
		KsModel*						Clone() { return new KsModel( this ); }

		/**
		 * ファイルからモデルデータを読み込む
		 * @retval		ksTRUE			成功
		 * @retval		ksFALSE			失敗
		 */
		KsBool							Load( const KsChar* pFileName );
		KsBool							Load( const KsFileObject* pFile );

	public:
		KsUInt16						m_flags;				/**< フラグ					*/
		KsUInt16						m_type;					/**< タイプ					*/
		KsChar							m_fileName[ 128 ];		/**< ファイル名				*/
		KsUInt16						m_numNode;				/**< ノード数				*/
		KsUInt16						m_reserv;				/**< 予備枠					*/
		KsModelNode*					m_pRoot;				/**< ルートノード			*/
		KsModelNodeList					m_pObjects;				/**< ノードリスト			*/
};


#endif		/* __KSMODEL_H__ */
