/************************************************************************************************/
/** 
 * @file		StScene.h
 * @brief		シーン
 * @author		Tsukasa Kato
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.1
 */
/************************************************************************************************/
#ifndef __STSCENE_H__
#define __STSCENE_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "StTask.h"

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/
class StSceneManager;

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		StTitle
 * @brief		タイトル
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.10
 * @note		なし
 */
/************************************************************************************************/
class StScene : public StTask
{
	public:
		/**
		 * コンストラクタ
		 */
											StScene();

		/**
		 * コンストラクタ
		 * @param		pSceneManager		シーンマネージャ
		 */
											StScene( StSceneManager* pSceneManager );

		/**
		 * デストラクタ
		 */
		virtual								~StScene();
	
	protected:
		/**
		 * 初期化処理(マネージャに登録されたときに登録)
		 * @param		pParam				パラメータ
		 */
		virtual void*						initialize( void* pParam );

		/**
		 * タスクの実行
		 * @param		pParam				パラメータ
		 */
		virtual void*						execute( void* pParam );

		/**
		 * 描画処理
		 * @param		pParam				パラメータ
		 */
		virtual void*						render( void* pParam );

		/**
		 * 後処理関数でメモリーから削除されるときに呼ばれる
		 * @param		pParam				パラメータ
		 */
		virtual void*						terminate( void* pParam );
		
	protected:
		StSceneManager*						m_pSceneManager;	/**< 親となるシーンマネージャのポインタ	*/
};




#endif /* __STSCENE_H__ */

