/************************************************************************************************/
/** 
 * @file		KsTextureGL.h
 * @brief		OepnGL用テクスチャ
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSTEXTUREGL_H__
#define __KSTEXTUREGL_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsTexture.h"
#include "KsImage.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * @class		KsTextureGL
 * @brief		テクスチャ
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @note		参照カウンタつき
 */
/************************************************************************************************/
class KsTextureGL : public KsTexture
{
		//friend class KsRenderSystemGL;
	public:
		KsImage*						m_pImage;		/**< イメージデータ						*/

	public:
		/**
		 * コンストラクタ
		 */
										KsTextureGL();

		/**
		 * コンストラクタ
		 * @param		pFileName		ファイル名
		 * @param		flags			読み込み方法のフラグ
		 */
										KsTextureGL( const KsChar* pFileName, KsUInt32 flags );

		/**
		 * コンストラクタ
		 * @param		pImage			イメージファイル
		 * @param		flags			読み込み方法のフラグ
		 */
										KsTextureGL( KsImage* pImage, KsUInt32 flags );

		/**
		 * デストラクタ
		 */
		virtual						~KsTextureGL();

		/**
		 * ロックする
		 * @return						データのポインタ
		 */
		virtual void*					lock();

		/**
		 * ロックを解除する
		 */
		virtual void					unlock();

		/**
		 * テクスチャの破棄
		 */
		virtual void					destroy();

		/**
		 * テクスチャをアクティブにする
		 */
		virtual void					active();
};

#endif		/* __KSTEXTUREGL_H__ */

