/************************************************************************************************/
/** 
 * @file		KsTextureManager.h
 * @brief		テクスチャマネージャ
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSTEXTUREMANAGER_H__
#define __KSTEXTUREMANAGER_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsTexture.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * @class		KsTextureManager
 * @brief		テクスチャマネージャ
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @note		本当は、ハッシュテーブルなどを使用したほうがいいがあまりテクスチャは、
 *				あまり、使わないはずなので線形で探索する。
 */
/************************************************************************************************/
class KsTextureManager
{
	protected:
		KsTexture*							m_pTop;		/**< リストの先頭ポインタ		*/

		/**
		 * コンストラクタ
		 */
											KsTextureManager();
	public:
		/**
		 * インスタンスを取得する
		 */
		static KsTextureManager*			instance();

		/**
		 * デストラクタ
		 */
		virtual							~KsTextureManager();

		/**
		 * 指定した名前のテクスチャを検索する
		 * 取得した後に参照カウントをあげる必要がある
		 */
		KsTexture*							find( const KsChar* pFileName );

		/**
		 * 検索して見つかったら参照カウントをアップする
		 */
		KsTexture*							findRefInc( const KsChar* pFileName );

		/**
		 * テクスチャを追加する
		 * DEBUGモードのときは、2重登録チェックをする
		 */
		KsBool								add( KsTexture* pTexture );

		/**
		 * テクスチャをマネージャから取り除く
		 */
		KsBool								remove( KsTexture* pTexture );

		/**
		 * 削除する
		 */
		KsBool								destroy( KsTexture* pTexture );

		/**
		 * すべてのテクスチャを破棄する(参照カウント関係なく破棄される)
		 */
		KsBool								destroyAll();
};

#endif		/* __KSTEXTUREMANAGER_H__ */



