/*************************************************************************************************/
/** 
 * @file	KsWindowUtil.cpp
 * @brief	Windows関係ユーティリティ
 * @author	Tukasa Kato
 * @date	2003/03/22
 * @since	----/--/--
 * @version	1.0.0
 */
/*************************************************************************************************/


/*===============================================================================================*/
/*                                 << インクルード >>                                             */
/*===============================================================================================*/
#include "KsWindowUtil.h"

/*************************************************************************************************/
/*
 * タスクバーを除いたデスクトップのサイズを取得する
 * @param		pRect		(OUT)サイズを取得する構造体のポインタ
 */
/*************************************************************************************************/
void KsGetDeskTopClientRect( RECT* pRect )
{
	// タスクバーを除いたサイズを取得する
	::SystemParametersInfo( SPI_GETWORKAREA, 0, pRect, 0 );
	//GetClientRect( GetDesktopWindow(), pRect );
}

/*************************************************************************************************/
/*
 * デスクトップのサイズを取得する
 * @param		pRect		(OUT)サイズを取得する構造体のポインタ
 */
/*************************************************************************************************/
void KsGetDeskTopWindowRect( RECT* pRect )
{
	::GetWindowRect( GetDesktopWindow(), pRect );
}

