/************************************************************************************************/
/** 
 * @file		KsOVRStereoEyeParams.cpp
 * @brief		OVR StereoEyeParams
 * @author		Tsukasa Kato
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		1.0.0
 */
/************************************************************************************************/

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/
#include "Aria/KsGamePreCompile.h"
#include "Aria/ovr/KsOVRStereoEyeParams.h"

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/*
 * OVRセットアップする
 * @retval		ksTRUE				OVRセットアップ成功
 * @retval		ksFALSE				OVRセットアップ失敗
 */
/************************************************************************************************/
void KsOVRStereoEyeParams::set( ksSTEREO_EYE_TYPE eye, const KsViewport& viewport, KsReal vofs, const KsMatrix4x4& proj, const KsMatrix4x4& orthoProj, const KsOVRDistortion* distortion )
{
	m_eyeType			= eye;
	m_viewport			= viewport;
	m_viewAdjust		= KsMatrix4x4::CreateTranslation( KsVector3d( vofs, 0.0f, 0.0f ) );
	m_projection		= proj;
	m_orthoProjection	= orthoProj;
	m_pDistortion		= distortion;
}


