/*************************************************************************************************/
/** 
 * @file	KsAppInstance.h
 * @brief	アプリケーションインスタンス
 * @author	Tukasa Kato
 * @date	2003/03/22
 * @since	----/--/--
 * @version	1.0.0
 */
/*************************************************************************************************/
#ifndef __KSAPPINSTANCE_H__
#define __KSAPPINSTANCE_H__

/*===============================================================================================*/
/*                                 << インクルード >>                                             */
/*===============================================================================================*/

/*===============================================================================================*/
/*                                     << 定義 >>                                                */
/*===============================================================================================*/


/*************************************************************************************************/
/**
 * @class	KsAppInstance
 * @brief	ウインドウアプリケーションのインスタンスクラス
 * @author  kato tukasa
 * @since   2003/03/22
 * @version ----/--/--
 */
/*************************************************************************************************/
class ksENGINE_API KsAppInstance
{
	public:
		static HINSTANCE				m_hInstance;		/**< ウィンドウ生成のパラメータ	*/
		static HINSTANCE				m_hPrevInstance;	/**< ウィンドウ生成のパラメータ	*/
		static LPSTR					m_lpCmdLine;		/**< ウィンドウ生成のパラメータ	*/
		static KsInt32					m_nCmdShow;			/**< ウィンドウ生成のパラメータ	*/

		/**
		 * パラメータをセットする
		 */
		static void						setup( HINSTANCE hInstance, HINSTANCE hPrevInstance, LPSTR lpCmdLine, KsInt32 nCmdShow );

		/**
		 * デストラクタ
		 */
										~KsAppInstance(){}

	private:
		/**
		 * コンストラクタ
		 */
										KsAppInstance(){}
};


#endif	/* __KSAPPINSTANCE_H__ */

