/************************************************************************************************/
/** 
 * @file		KsPostEffectManager.h
 * @brief		ポストエフェクトマネージャ
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSPOSTEFFECTMANAGER_H__
#define __KSPOSTEFFECTMANAGER_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/
#include "KsGameCommon.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/************************************************************************************************/
/**
 * @class		KsPostEffectManager
 * @brief		ゲームシングルトン
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class KsPostEffectManager : public KsSingleton< KsPostEffectManager >
{
	public:
		/**
		 * コンストラクタ
		 */
											KsPostEffectManager();

		/**
		 * デストラクタ
		 */
		virtual							~KsPostEffectManager();

	public:
		/**
		 * シングルトンの参照を取得
		 * @return							シングルトンの参照
		 */
		static KsPostEffectManager&			getInstance();
		
		/**
		 * シングルトンのポインタを取得
		 * @return							シングルトンのポインタ
		 */
		static KsPostEffectManager*			getInstancePtr();
};


#endif /* __KSGAMESCRIPTLIB_H__ */



