/************************************************************************************************/
/** 
 * @file		KsTaskBase.cpp
 * @brief		基本タスク
 * @author		Tsukasa Kato
 * @date		2004/10/17
 * @since		2004/10/17
 * @version		0.1
 */
/************************************************************************************************/

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsTaskBase.h"
#include "KsTaskManager.h"
#include "KsWorkArea.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/*
 * コンストラクタ
 */
/************************************************************************************************/
KsTaskBase::KsTaskBase() :	m_id( 0 ),
					m_flags( ksTASK_FALGS_INITIALIZE ),
					m_order( ksTASK_ORDER_DEFAULT ),
					m_type( ksTASK_TYPE_BASE ),
					m_pParent( 0 ),
					m_pPrevBrother( 0 ),
					m_pNextBrother( 0 ),
					m_pChild( 0 ),
					m_pPrev( 0 ),
					m_pNext( 0 ),
					m_pManager( 0 )
{
}

/************************************************************************************************/
/*
 * コンストラクタ
 * @param	order	描画オーダー
 */
/************************************************************************************************/
KsTaskBase::KsTaskBase( KsUInt32 order )
	: m_id( 0 )
	, m_flags( ksTASK_FALGS_INITIALIZE )
	, m_order( order )
	, m_type( ksTASK_TYPE_BASE )
	, m_pParent( 0 )
	, m_pPrevBrother( 0 )
	, m_pNextBrother( 0 )
	, m_pChild( 0 )
	, m_pPrev( 0 )
	, m_pNext( 0 )
	, m_pManager( 0 )
{
}

/************************************************************************************************/
/*
 * デストラクタ
 */
/************************************************************************************************/
KsTaskBase::~KsTaskBase()
{
}
/************************************************************************************************/
/*
 * 長男の先頭ポインタに最後尾のポインタを入れておく
 */
/************************************************************************************************/
void KsTaskBase::addBrother( KsTaskBase* pTask, void* pUserData )
{
	/* 高速にする */
	if( m_pParent ){
		/* 最後の兄弟を取得 */
		/* このタスクの兄弟になるはずなので、m_pParent->m_pChildがNULLであることはないはず */
		KsTaskBase*		pLast = m_pParent->m_pChild->m_pPrevBrother;

		/* 最後尾保存用 */
		m_pParent->m_pChild->m_pPrevBrother = pTask;

		/* リンク */
		pLast->m_pNextBrother = pTask;
		pTask->m_pPrevBrother = pLast;

		/* 親セット */
		pTask->m_pParent = m_pParent;
	}
	else{
		KsTaskBase*		pTop = getTopBrother();

		/* ルートなので長男を取得 */
		pTop->m_pPrevBrother->m_pNextBrother = pTask;

		/* このとき追加するタスクに兄弟がいたらだめだ */
		/* キチンの兄弟がいるかチェックしてセットする */

		if( pTask->m_pNextBrother ){
			/* すでに兄弟がいるので最後尾を取得する */
			pTop->m_pPrevBrother = pTask->getEndBrother();
		}
		else{
			pTop->m_pPrevBrother = pTask;
		}
	}

	/* 描画リンクをセットする */
	pTask->m_pManager = m_pManager;

	if( m_pManager ){
		/* 登録 */
		m_pManager->m_renderTbl.entry( pTask );
	}

	/* 初期化フラグをチェックする */
	if( pUserData && pTask->m_flags & ksTASK_FALGS_INITIALIZE ){
		/* 初期化 */
		pTask->initialize( pUserData );
		/* 初期化終了 */
		pTask->m_flags &= (KsUInt32)(~ksTASK_FALGS_INITIALIZE);
		//pTask->m_id = m_taskID;
		//m_taskID++;
	}
}

/************************************************************************************************/
/*
 * 
 */
/************************************************************************************************/
void KsTaskBase::addChild( KsTaskBase* pTask, void* pUserData )
{
	//KsAssert( pTask != NULL, "追加した子タスクがNULLです。" );

	if( m_pChild )
	{
		/* 兄弟追加 */
		m_pChild->addBrother( pTask, pUserData );
	}
	else
	{
		/* 子供に追加 */
		m_pChild = pTask;

		/* 最後尾情報セット */
		m_pChild->m_pPrevBrother = pTask;

		/* 親セット */
		m_pChild->m_pParent = this;

		/* 描画リンクをセットする */
		pTask->m_pManager = m_pManager;

		if( m_pManager ){
			/* 登録 */
			m_pManager->m_renderTbl.entry( pTask );
		}

		/* 初期化フラグをチェックする */
		if( pUserData && pTask->m_flags & ksTASK_FALGS_INITIALIZE ){
			/* 初期化 */
			pTask->initialize( pUserData );
			/* 初期化終了 */
			pTask->m_flags &= (KsUInt32)(~ksTASK_FALGS_INITIALIZE);
			//pTask->m_id = m_taskID;
			//m_taskID++;
		}
	}
}

/************************************************************************************************/
/*
 * 描画リンクから取り外す
 */
/************************************************************************************************/
void KsTaskBase::removeRenderLink( KsTaskBase* pTask )
{
	KsTaskBase*		pTemp = pTask;

	/* マネージャがわからないと不可能 */
	if( m_pManager ){
		m_pManager->m_renderTbl.remove( this );
		m_pManager = NULL;

		if( m_pChild ){
			removeRenderLink( m_pChild );
		}

		if( m_pNextBrother ){
			removeRenderLink( m_pNextBrother );
		}
	}
}
/************************************************************************************************/
/*
 * 完全に切り離すdetachが必要
 * @param		pTask				取り除く子タスクのポインタ
 * 完全に切り離されて1つのタスクになる
 */
/************************************************************************************************/
KsTaskBase* KsTaskBase::cut()
{
	/* 取り外す */
	detach();

	/* すべての子供の親をNULLにする */
	KsUInt32	index  = 0;
	KsTaskBase*		pChild = m_pChild;
	KsTaskBase*		pTask  = getChild( index );

	while( pTask )
	{
		pTask->m_pParent = NULL;
		++index;
		pTask = getChild( index );
	}

	m_pChild       = NULL;
	m_pPrevBrother = NULL;
	m_pNextBrother = NULL;

	return pChild;
}

/************************************************************************************************/
/*
 * 自分のタスクだけを削除する
 */
/************************************************************************************************/
void KsTaskBase::remove()
{
	/* 取り外す */
	detach();
	
	/* 削除フラグを立てる？でもその場合マネージャに登録されていないとだめなのでワークエリアを使用する？ */
	KsWorkArea::push( this );
}
/************************************************************************************************/
/*
 * 自分のタスクだけを削除する
 */
/************************************************************************************************/
void KsTaskBase::destroy()
{
	/* 取り外す */
	detach();
	
	/* 削除フラグを立てる？でもその場合マネージャに登録されていないとだめなのでワークエリアを使用する？ */
	KsWorkArea::push( this );
}
/************************************************************************************************/
/*
 * 描画リンクを変更する
 * @param		order				新しいオーダー
 */
/************************************************************************************************/
void KsTaskBase::changeRenderLink( KsUInt32 order )
{
	/* この時点で描画リンクを変更 */
	if( m_pManager ){
		/* 取り除く */
		m_pManager->m_renderTbl.remove( this );
		/* 新たに追加 */
		m_order = order;
		m_pManager->m_renderTbl.entry( this );
	}
}
/************************************************************************************************/
/**
 * 
 */
/************************************************************************************************/
void KsTaskBase::setName( const KsChar* string )
{
	strncpy( m_name, string, ksTASK_NAME_LENGTH - 1 );

	/* null 文字セット */
	m_name[ ksTASK_NAME_LENGTH - 1 ] = '\0';
}
/************************************************************************************************/
/*
 * 
 */
/************************************************************************************************/
void KsTaskBase::setID( KsUInt32 id )
{
	m_id = id;
}
/************************************************************************************************/
/*
 * 
 */
/************************************************************************************************/
void KsTaskBase::setFlags( KsUInt32 flags )
{
	m_flags = flags;
}
/************************************************************************************************/
/*
 *
 * 優先順位をセットする
 * @return							プライオリティ
 */
/************************************************************************************************/
void KsTaskBase::setPriority( KsInt32 priority )
{
	m_priority.i = priority;
}
/************************************************************************************************/
/*
 * オーダをセット
 */
/************************************************************************************************/
void KsTaskBase::setOrder( KsUInt32 order )
{
	m_order = order;
}
/************************************************************************************************/
/*
 * Z値をセットする
 * @param		z					z値
 */
/************************************************************************************************/
void KsTaskBase::setZsort( KsReal z )
{
	m_priority.z = z;
}
/************************************************************************************************/
/*
 * 
 */
/************************************************************************************************/
const KsChar* KsTaskBase::getName()
{
	return m_name;
}
/************************************************************************************************/
/*
 * 
 */
/************************************************************************************************/
KsUInt32 KsTaskBase::getID() const
{
	return m_id;
}
/************************************************************************************************/
/*
 * 
 */
/************************************************************************************************/
KsUInt32 KsTaskBase::getFlags() const
{
	return	m_flags;
}
/************************************************************************************************/
/*
 * タスクのタイプを取得する
 */
/************************************************************************************************/
ksTASK_TYPE KsTaskBase::getType() const
{
	return m_type;
}
/************************************************************************************************/
/*
 * 優先順位をセットする
 */
/************************************************************************************************/
KsTaskPRIORITY KsTaskBase::getPriority() const
{
	return m_priority;
}
/************************************************************************************************/
/*
 * オーダをセット
 */
/************************************************************************************************/
KsUInt32 KsTaskBase::getOrder() const
{
	return m_order;
}
/************************************************************************************************/
/*
 * 親タスクを取得する
 * @return		親タスクのポインタ
 */
/************************************************************************************************/
KsTaskBase* KsTaskBase::getParent()
{
	return m_pParent;
}
		
/************************************************************************************************/
/*
 * 長男タスクを取得する
 */
/************************************************************************************************/
KsTaskBase* KsTaskBase::getTopBrother()
{
	/* 最後尾を取得 */
	if( m_pParent ){
		return m_pParent->m_pChild;
	}
	else{
		/* ルートのとき */
		KsTaskBase*		pTop  = m_pPrevBrother;

		while( pTop->m_pPrevBrother->m_pNextBrother ){
				pTop = pTop->m_pPrevBrother;
		}

		return pTop;
	}

	return NULL;
}
/************************************************************************************************/
/*
 * 最後尾タスクを取得する
 */
/************************************************************************************************/
KsTaskBase* KsTaskBase::getEndBrother()
{
	KsTaskBase*		pTemp = m_pNextBrother;

	if( pTemp ){
		while( pTemp->m_pNextBrother ){

			pTemp = pTemp->m_pNextBrother;
		}

		return pTemp;
	}

	return this;
}

/************************************************************************************************/
/*
 * 兄タスクを取得する(ルートだったらわからない)
 */
/************************************************************************************************/
KsTaskBase* KsTaskBase::getPrevBrother()
{
	return m_pPrevBrother;
}
/************************************************************************************************/
/*
 * 弟タスクを取得する(ルートだったらわからない)
 */
/************************************************************************************************/
KsTaskBase* KsTaskBase::getNextBrother()
{
	return m_pNextBrother;
}

/************************************************************************************************/
/*
 * ID検索
 */
/************************************************************************************************/
KsTaskBase* KsTaskBase::find( KsUInt32 id )
{
	allChildCallback( m_pChild, KsTaskFindID, (void*)(&param) );
	
	return param.pTask;
}

/************************************************************************************************/
/*
 *
 */
/************************************************************************************************/
KsTaskBase* KsTaskBase::find( const KsChar* name )
{
	allChildCallback( m_pChild, KsTaskFindName, (void*)(&param) );
	
	return param.pTask;
}

