/************************************************************************************************/
/** 
 * @file		KsMemoryFixedUnit.h
 * @brief		固定メモリ管理（フリーリスト）
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSMEMORYUNIT_H__
#define __KSMEMORYUNIT_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * メモリーユニット
 * @class		KsMemoryUnit
 * @author		Tsukasa Kato
 */
/************************************************************************************************/
class ksENGINE_API KsMemoryUnit
{
	public:
		KsSize				m_actualSize;						/**< メモリーの実サイズ			*/
		KsSize				m_requestSize;						/**< メモリーのリクエストサイズ		*/
		void*				m_pActualAddress;					/**< 実メモリーのアドレス			*/
		void*				m_pRequestAddress;					/**< リクエストメモリーのアドレス	*/
		KsUInt32			m_sourceLine;						/**< ソースで確保した場所の行数		*/
		KsChar				m_sourceFile[ ksMEMORY_NAME_SIZE ];	/**< ソースファイル名				*/
		KsChar				m_funcName[ ksMEMORY_NAME_SIZE ];	/**< 関数名						*/
		KsChar				m_userTag[ ksMEMORY_NAME_SIZE ];	/**< ユーザータグ名				*/
		KsUInt32			m_allocType;						/**< メモリーのタイプ				*/
		KsUInt32			m_allocNumber;						/**< メモリの確保ナンバー			*/
		KsMemoryUnit*		m_pNext;							/**< 次のユニットのポインタ			*/
		KsMemoryUnit*		m_pPrev;							/**< 前のユニットのポインタ			*/
};


#endif		/* __KSMEMORYUNIT_H__ */

