/************************************************************************************************/
/** 
 * @file		KsMemoryAllocType.h
 * @brief		固定メモリ管理（フリーリスト）
 * @author		Tsukasa Kato
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSMEMORYDEFINE_H__
#define __KSMEMORYDEFINE_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

#define ksMEMORY_NAME_SIZE			( 32 )						/**< ソースファイル名のサイズ	*/
#define ksMEMORY_HASH_BITS			( 12 )						/**< ハッシュに使うビット		*/
#define ksMEMORY_HASH_SIZE			( 1 << ksMEMORY_HASH_BITS )	/**< ハッシュサイズ			*/
#define ksMEMORY_UNIT_ALLOC_SIZE	( 1 << 12 )					/**< メモリーユニット確保数		*/
#define ksMEMORY_TAG_STACK_SIZE		( 32 )						/**< タグスタックサイズ		*/
#define ksMEMORY_TAG_DEFAULT_NAME	"system"					/**< デフォルトユーザータグ名	*/
#define ksMEMORY_DUMP_FILE_NAME		"memoryLeaks.log"			/**< ダンプするファイル名		*/
#define ksPADDING_SIZE				( 4 * sizeof( KsLong ) )	/**< パディングサイズ			*/
#define ksMEMORY_ALIGNMENT_DEFAULT	( 16 )						/**< メモリーアラインメント		*/

#ifndef __FUNCTION__
	#define __FUNCTION__ "??"				/* 関数名のマクロ定義されていなかったと用	*/
#endif



#endif		/* __KSMEMORYDEFINE_H__ */

