/************************************************************************************************/
/** 
 * @file		KsDrawList.h
 * @brief		描画タスク
 * @author		Tsukasa Kato
 * @date		2011/10/17
 * @since		2011/10/17
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSDRAWLIST_H__
#define __KSDRAWLIST_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/


/************************************************************************************************/
/**
 * @class		KsDrawList
 * @brief		描画タスクリスト
 * @date		2011/10/17
 * @since		2011/10/17
 * @version		1.0.0
 */
/************************************************************************************************/
class ksENGINE_API KsDrawList
{
		friend class KsTaskManager;
		friend class KsDraw;
	
	public:
		/**
		 * コンストラクタ
		 * @brief	0で初期化される
		 */
											KsDrawList();

		/**
		 * デストラクタ
		 */
		virtual								~KsDrawList();

		/**
		 * 描画するかどうかをセットする
		 * @param		drawActive		描画するかどうかをセットする
		 */
		void								setActive( KsBool isActive ) { m_isActive = isActive; }

		/**
		 * 描画するかどうかを取得する
		 * @return		描画するかどうかを取得する
		 */
		KsBool								isActive() const { return m_isActive; }
		
		/**
		 * 描画タスクを追加する
		 * @param		pDraw				描画タスク
		 */
		void								add( KsDraw* pDraw );

		/**
		 * 描画タスクを取り除く
		 * @param		pDraw				描画タスク
		 */
		void								remove( KsDraw* pDraw );

		/**
		 * 描画タスクを取り除く
		 * @param		pDraw				描画タスク
		 */
		void								draw( void* pParam );

	protected:
		KsBool								m_isActive;		/**< 描画アクティブフラグ				*/
		KsDraw*								m_pDrawRoot;	/**< 描画ルート						*/
		KsDraw*								m_pDrawLast;	/**< 描画ラスト						*/
		KsTaskManager*						m_pDrawManager;	/**< タスクマネージャ					*/
};

#endif /* __KSDRAWLIST_H__ */

